x = 5 #запись переменной
print(x, type(x)) #вывод типа данных переменной (x) ответ 5 <class 'int'>
x = bool (x) #присваивание переменной x тип данных булев
print(x, type(x)) #вывод типа данных переменной (x) ответ True <class 'bool'>

y = 4 #запись переменной
print(y, type(y)) #вывод типа данных переменной (y) ответ 4 <class 'int'>
y = str (y) #присваивание переменной y тип данных cтрока
print(y, type(y)) #вывод типа данных переменной (y) ответ 4 <class 'str'>

c = 5.7 #запись переменной
print(c, type(c)) #вывод типа данных переменной (c) ответ 5.7 <class 'float'>
c = int(c) ##присваивание переменной (с) тип данных инт
print(c, type(c)) #вывод типа данных переменной (с) ответ 5 <class 'int'>

my_true = True #обьявление переменной
my_false = False #обьявление переменной
print(type(my_true)) #bool
print(type(my_false)) #bool

b = 5 #запись переменной
b = str(b) #присваивание переменной тип данных строка
print(b, type(b)) #вывод переменной (b)
b = bool(b) #присваивание переменной новый тип данных буллев
print(b, type(b)) #вывод переменной